/*
Переменная (variable) - "именнованное хранилице данных"

Обявляются с помощью var, let, const
let - современный способ объявления
var - устаревший способ объявления
const - значения переменной не может изменяться

1. Имя переменной должно содержать только буквы, цифры или символы $ и _.
2. Первый символ не должен быть цифрой.

Имена let, class, return и function зарезервированы.


*/

num = 5; //работает без "use strict", иначе будет ошибка
console.log(5);

/*
Константы
константы с именами, записанными заглавными буквами,
    используются только как псевдонимы для «жёстко закодированных» значений

для вычисляемых лучше писать с маленькой

Нейминг
- функции-предикаты - isUserDisabled()
- обработка событий -  userChangeHandler()
- функции-действия - disableUser()

*/